tasks/02-conf/src/Configuration/Documents/ВводВЭксплуатацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ВводВЭксплуатацию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ОборудованиеВЭксплуатации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

tasks/02-conf/src/Configuration/AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

tasks/02-conf/src/Configuration/AccumulationRegisters/ОборудованиеВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ОборудованиеВЭксплуатации</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

tasks/02-conf/src/Configuration/Documents/ВводВЭксплуатацию/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Регистрируем движения: списание с остатков и ввод в эксплуатацию
	Движения.ОстаткиНоменклатуры.Записать();
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	Движения.ОборудованиеВЭксплуатации.Записать();
	Движения.ОборудованиеВЭксплуатации.Записывать = Истина; 
	
	НачалоДняДокумента = НачалоДня(Дата);
	
	// ===== КРИТИЧЕСКИЙ МОМЕНТ: БЛОКИРОВКА ДАННЫХ =====
	// Для предотвращения двойного ввода одного оборудования разными пользователями
	// блокируем остатки по сроку годности (от начала дня документа)
	// Это гарантирует, что два документа не выберут одни и те же остатки
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	// Фильтруем только оборудование с неистекшим сроком годности
    	// Диапазон от начала дня документа до бесконечности
	ЭлементБлокировки.УстановитьЗначение("СрокГодности", Новый Диапазон(НачалоДняДокумента));
	
	// Блокируем конкретную номенклатуру из документа
	ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();
	
	// ===== ЗАПРОС ДЛЯ ПРИОРИТЕТНОГО СПИСАНИЯ =====
    // Получаем остатки, упорядоченные по сроку годности (FIFO по сроку)
    // Сначала списываем оборудование с наименьшим оставшимся сроком годности
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВводВЭксплуатациюСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(ВводВЭксплуатациюСписокНоменклатуры.Количество) КАК Количество,
		|	ВводВЭксплуатациюСписокНоменклатуры.Номенклатура.СрокЭксплуатацииДней КАК НоменклатураСрокЭксплуатацииДней
		|ПОМЕСТИТЬ втТЧОборудование
		|ИЗ
		|	Документ.ВводВЭксплуатацию.СписокНоменклатуры КАК ВводВЭксплуатациюСписокНоменклатуры
		|ГДЕ
		|	ВводВЭксплуатациюСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводВЭксплуатациюСписокНоменклатуры.Номенклатура,
		|	ВводВЭксплуатациюСписокНоменклатуры.Номенклатура.СрокЭксплуатацииДней
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧОборудование.Номенклатура КАК Номенклатура,
		|	втТЧОборудование.Количество КАК Количество,
		|	ОстаткиНоменклатурыОстатки.СрокГодности КАК СрокГодности,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СебестоимостьОстаток, 0) КАК СебестоимостьОстаток,
		|	втТЧОборудование.Номенклатура.Представление КАК НоменклатураПредставление,
		|	ДОБАВИТЬКДАТЕ(&НачалоДня, ДЕНЬ, втТЧОборудование.НоменклатураСрокЭксплуатацииДней) КАК СрокЭксплуатации
		|ИЗ
		|	втТЧОборудование КАК втТЧОборудование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							втТЧОборудование.Номенклатура КАК Номенклатура
		|						ИЗ
		|							втТЧОборудование КАК втТЧОборудование)
		|					И СрокГодности >= &НачалоДня) КАК ОстаткиНоменклатурыОстатки
		|		ПО втТЧОборудование.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	СрокГодности
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("НачалоДня", НачалоДняДокумента);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//По итоговым записям проводим контроль остатков и выводим сообщения в случае нехватки номенклатуры.
	Пока ВыборкаНоменклатура.Следующий() Цикл 
		Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличествоОстаток Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Оборудования %1, в приходной накладной было меньше, чем вы пытаетесь ввести в эксплуатацию, на %2 единиц",
										ВыборкаНоменклатура.НоменклатураПредставление,
										ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.КоличествоОстаток);
			Сообщение.Сообщить();
		КонецЕсли;
		
		//Если отказ тогда идём в следующую итерацию цикла
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоСписать = ВыборкаНоменклатура.Количество;
		Выборка = ВыборкаНоменклатура.Выбрать();
		
		//Далее выборка по детальным записям, в ней рассчитываем себестоимость по условию последнего списания и делаем расходные движения по
		//регистру ОстаткиНоменклатуры и приходные движения по регистру ОборудованиеВЭкспулатацию.
		Пока Выборка.Следующий() И КоличествоСписать > 0 Цикл
			Количество = Мин(КоличествоСписать, Выборка.КоличествоОстаток);
			Если Количество = Выборка.КоличествоОстаток Тогда
				Себестоимость = Выборка.СебестоимостьОстаток;
			Иначе
				Себестоимость = Выборка.СебестоимостьОстаток *  Количество / Выборка.КоличествоОстаток;
			КонецЕсли;
			
			Движение = Движения.ОстаткиНоменклатуры.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.СрокГодности = Выборка.СрокГодности;
			Движение.Количество = Количество;
			Движение.Себестоимость = Себестоимость;
						
			Движение = Движения.ОборудованиеВЭксплуатации.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.СрокГодности = Выборка.СрокГодности;
			Движение.СрокЭксплуатации = Выборка.СрокЭксплуатации;
			Движение.Количество = Количество;
			Движение.Себестоимость = Себестоимость;  
			
			КоличествоСписать = КоличествоСписать - Количество;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
